zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp251dxx_cm0.h
/*
 * @brief HW Semaphore (HSEM)
 */
typedef struct
{
  __IO uint32_t R[16];           /*!< HSEM register                                    Address offset: 0x000-0x03C */
       uint32_t RESERVED0[16];   /*!< Reserved                                         Address offset: 0x040-0x07C */
  __IO uint32_t RLR[16];         /*!< HSEM read lock register                          Address offset: 0x080-0x0BC */
       uint32_t RESERVED1[16];   /*!< Reserved                                         Address offset: 0x0C0-0x0FC */
  __IO uint32_t C1IER;           /*!< HSEM non-secure Interrupt enable register        Address offset: 0x100 */
  __IO uint32_t C1ICR;           /*!< HSEM non-secure Interrupt clear register         Address offset: 0x104 */
  __IO uint32_t C1ISR;           /*!< HSEM non-secure Interrupt status register        Address offset: 0x108 */
  __IO uint32_t C1MISR;          /*!< HSEM Masked non-secure interrupt status register Address offset: 0x10C */
  __IO uint32_t C2IER;           /*!< HSEM non-secure Interrupt enable register        Address offset: 0x110 */
  __IO uint32_t C2ICR;           /*!< HSEM non-secure Interrupt clear register         Address offset: 0x114 */
  __IO uint32_t C2ISR;           /*!< HSEM non-secure Interrupt status register        Address offset: 0x118 */
  __IO uint32_t C2MISR;          /*!< HSEM Masked non-secure interrupt status register Address offset: 0x11C */
  __IO uint32_t C3IER;           /*!< HSEM non-secure Interrupt enable register        Address offset: 0x120 */
  __IO uint32_t C3ICR;           /*!< HSEM non-secure Interrupt clear register         Address offset: 0x124 */
  __IO uint32_t C3ISR;           /*!< HSEM non-secure Interrupt status register        Address offset: 0x128 */
  __IO uint32_t C3MISR;          /*!< HSEM Masked non-secure interrupt status register Address offset: 0x12C */
       uint32_t RESERVED2[20];   /*!< Reserved                                         Address offset: 0x130-0x17C */
  __IO uint32_t SC1IER;          /*!< HSEM secure interrupt enable register            Address offset: 0x180 */
  __IO uint32_t SC1ICR;          /*!< HSEM secure interrupt clear register             Address offset: 0x184 */
  __IO uint32_t SC1ISR;          /*!< HSEM Secure interrupt status register            Address offset: 0x188 */
  __IO uint32_t SC1MISR;         /*!< HSEM Secure masked interrupt status register     Address offset: 0x18C */
  __IO uint32_t SC2IER;          /*!< HSEM secure interrupt enable register            Address offset: 0x190 */
  __IO uint32_t SC2ICR;          /*!< HSEM secure interrupt clear register             Address offset: 0x194 */
  __IO uint32_t SC2ISR;          /*!< HSEM Secure interrupt status register            Address offset: 0x198 */
  __IO uint32_t SC2MISR;         /*!< HSEM Secure masked interrupt status register     Address offset: 0x19C */
  __IO uint32_t SC3IER;          /*!< HSEM secure interrupt enable register            Address offset: 0x1A0 */
  __IO uint32_t SC3ICR;          /*!< HSEM secure interrupt clear register             Address offset: 0x1A4 */
  __IO uint32_t SC3ISR;          /*!< HSEM Secure interrupt status register            Address offset: 0x1A8 */
  __IO uint32_t SC3MISR;         /*!< HSEM Secure masked interrupt status register     Address offset: 0x1AC */
       uint32_t RESERVED3[20];   /*!< Reserved                                         Address offset: 0x1B0-0x1FC */
  __IO uint32_t SECCFGR;         /*!< HSEM Security configuration register             Address offset: 0x200 */
       uint32_t RESERVED4[3];    /*!< Reserved                                         Address offset: 0x204-0x20C */
  __IO uint32_t PRIVCFGR;        /*!< HSEM Privilege configuration register            Address offset: 0x210 */
       uint32_t RESERVED5[3];    /*!< Reserved                                         Address offset: 0x214-0x21C */
  __IO uint32_t C1CIDCFGR;       /*!< HSEM processor 1 CID configuration register      Address offset: 0x220 */
  __IO uint32_t C2CIDCFGR;       /*!< HSEM processor 2 CID configuration register      Address offset: 0x224 */
  __IO uint32_t C3CIDCFGR;       /*!< HSEM processor 3 CID configuration register      Address offset: 0x228 */
       uint32_t RESERVED6;       /*!< Reserved                                         Address offset: 0x22C */
  __IO uint32_t CR;              /*!< HSEM Clear register                              Address offset: 0x230 */
  __IO uint32_t KEYR;            /*!< HSEM clear key register                          Address offset: 0x234 */
       uint32_t RESERVED7[2];    /*!< Reserved                                         Address offset: 0x238-0x23C */
  __IO uint32_t G0CIDCFGR;       /*!< HSEM CID configuration register                  Address offset: 0x240 */
  __IO uint32_t G1CIDCFGR;       /*!< HSEM CID configuration register                  Address offset: 0x244 */
  __IO uint32_t G2CIDCFGR;       /*!< HSEM CID configuration register                  Address offset: 0x248 */
  __IO uint32_t G3CIDCFGR;       /*!< HSEM CID configuration register                  Address offset: 0x24C */
       uint32_t RESERVED8[103];  /*!< Reserved                                         Address offset: 0x250-0x3E8 */
  __I  uint32_t HWCFGR2;         /*!< HSEM hardware configuration register 2           Address offset: 0x3EC */
  __I  uint32_t HWCFGR1;         /*!< HSEM hardware configuration register 1           Address offset: 0x3F0 */
  __I  uint32_t VERR;            /*!< HSEM IP version register                         Address offset: 0x3F4 */
  __I  uint32_t IPIDR;           /*!< HSEM IP identification register                  Address offset: 0x3F8 */
  __I  uint32_t SIDR;            /*!< HSEM size identification register                Address offset: 0x3FC */
} HSEM_TypeDef;

typedef struct
{
  __IO uint32_t IER;             /*!< HSEM Interrupt enable register                   Address offset: 0x000 */
  __IO uint32_t ICR;             /*!< HSEM Interrupt clear register                    Address offset: 0x004 */
  __IO uint32_t ISR;             /*!< HSEM Interrupt status register                   Address offset: 0x008 */
  __IO uint32_t MISR;            /*!< HSEM Masked interrupt status register            Address offset: 0x00C */
} HSEM_Common_TypeDef;

/**
  * @brief Inter-integrated Circuit Interface (I2C)
  */

typedef struct
{
  __IO uint32_t CR1;            /*!< I2C Control register 1                 Address offset: 0x00 */
  __IO uint32_t CR2;            /*!< I2C Control register 2                 Address offset: 0x04 */
  __IO uint32_t OAR1;           /*!< I2C Own address 1 register             Address offset: 0x08 */
  __IO uint32_t OAR2;           /*!< I2C Own address 2 register             Address offset: 0x0C */
  __IO uint32_t TIMINGR;        /*!< I2C Timing register                    Address offset: 0x10 */
  __IO uint32_t TIMEOUTR;       /*!< I2C Timeout register                   Address offset: 0x14 */
  __IO uint32_t ISR;            /*!< I2C Interrupt and status register      Address offset: 0x18 */
  __IO uint32_t ICR;            /*!< I2C Interrupt clear register           Address offset: 0x1C */
  __IO uint32_t PECR;           /*!< I2C PEC register                       Address offset: 0x20 */
  __IO uint32_t RXDR;           /*!< I2C Receive data register              Address offset: 0x24 */
  __IO uint32_t TXDR;           /*!< I2C Transmit data register             Address offset: 0x28 */
  __IO uint32_t AUTOCR;         /*!< I2C Autonomous mode control register   Address offset: 0x2C */
       uint32_t RESERVED[240];  /*!< Reserved                               Address offset: 0x30->0x3EC */
  __IO uint32_t HWCFGR;         /*!< I2C hardware configuration register    Address offset: 0x3F0 */
  __IO uint32_t VERR;           /*!< I2C version register                   Address offset: 0x3F4 */
  __IO uint32_t IPIDR;          /*!< I2C identification register            Address offset: 0x3F8 */
  __IO uint32_t SIDR;           /*!< I2C size identification register       Address offset: 0x3FC */
} I2C_TypeDef;

/**
  * @brief Inter-integrated Circuit Interface (I3C)
  */
typedef struct
{
  __IO uint32_t CR;              /*!< I3C message control register                Address offset: 0x000 */
  __IO uint32_t CFGR;            /*!< I3C configuration register                  Address offset: 0x004 */
       uint32_t RESERVED0[2];    /*!< Reserved                                    Address offset: 0x008-0x00C */
  __IO uint32_t RDR;             /*!< I3C receive data byte register              Address offset: 0x010 */
  __IO uint32_t RDWR;            /*!< I3C receive data word register              Address offset: 0x014 */
  __IO uint32_t TDR;             /*!< I3C transmit data byte register             Address offset: 0x018 */
  __IO uint32_t TDWR;            /*!< I3C transmit data word register             Address offset: 0x01C */
  __IO uint32_t IBIDR;           /*!< I3C IBI payload data register               Address offset: 0x020 */
  __IO uint32_t TGTTDR;          /*!< I3C target transmit configuration register  Address offset: 0x024 */
       uint32_t RESERVED1[2];    /*!< Reserved                                    Address offset: 0x028-0x02C */
  __IO uint32_t SR;              /*!< I3C status register                         Address offset: 0x030 */
  __IO uint32_t SER;             /*!< I3C status error register                   Address offset: 0x034 */
       uint32_t RESERVED2[2];    /*!< Reserved                                    Address offset: 0x038-0x03C */
  __IO uint32_t RMR;             /*!< I3C received message register               Address offset: 0x040 */
       uint32_t RESERVED3[3];    /*!< Reserved                                    Address offset: 0x044-0x04C */
  __IO uint32_t EVR;             /*!< I3C event register                          Address offset: 0x050 */
  __IO uint32_t IER;             /*!< I3C interrupt enable register               Address offset: 0x054 */
  __IO uint32_t CEVR;            /*!< I3C clear event register                    Address offset: 0x058 */
       uint32_t RESERVED4;       /*!< Reserved                                    Address offset: 0x05C */
  __IO uint32_t DEVR0;           /*!< I3C own device characteristics register     Address offset: 0x060 */
  __IO uint32_t DEVRX[4];        /*!< I3C device x (0<=x<=4) register             Address offset: 0x064-0x070 */
       uint32_t RESERVED5[7];    /*!< Reserved                                    Address offset: 0x074-0x08C */
  __IO uint32_t MAXRLR;          /*!< I3C maximum read length register            Address offset: 0x090 */
  __IO uint32_t MAXWLR;          /*!< I3C maximum write length register           Address offset: 0x094 */
       uint32_t RESERVED6[2];    /*!< Reserved                                    Address offset: 0x098-0x09C */
  __IO uint32_t TIMINGR0;        /*!< I3C timing register 0                       Address offset: 0x0A0 */
  __IO uint32_t TIMINGR1;        /*!< I3C timing register 1                       Address offset: 0x0A4 */
  __IO uint32_t TIMINGR2;        /*!< I3C timing register 2                       Address offset: 0x0A8 */
       uint32_t RESERVED7[5];    /*!< Reserved                                    Address offset: 0x0AC-0x0BC */
  __IO uint32_t BCR;             /*!< I3C bus characteristics register            Address offset: 0x0C0 */
  __IO uint32_t DCR;             /*!< I3C device characteristics register         Address offset: 0x0C4 */
  __IO uint32_t GETCAPR;         /*!< I3C get capability register                 Address offset: 0x0C8 */
  __IO uint32_t CRCAPR;          /*!< I3C controller-role capability register     Address offset: 0x0CC */
  __IO uint32_t GETMXDSR;        /*!< I3C get capability register                 Address offset: 0x0D0 */
  __IO uint32_t EPIDR;           /*!< I3C extended provisioned ID register        Address offset: 0x0D4 */
       uint32_t RESERVED8[198];  /*!< Reserved                                    Address offset: 0x0D8-0x3EC */
  __IO uint32_t HWCFGR;          /*!< I3C hardware configuration register         Address offset: 0x3F0 */
  __IO uint32_t VERR;            /*!< I3C version register                        Address offset: 0x3F4 */
  __IO uint32_t IPIDR;           /*!< I3C IP identification register              Address offset: 0x3F8 */
  __IO uint32_t SIDR;            /*!< I3C IP size identification register         Address offset: 0x3FC */
} I3C_TypeDef;

