zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp251dxx_cm0.h
/*******************  Bit definition for MDF/ADF_SADANLVR register  ********************/
#define MDF_SADANLVR_ANLVL_Pos              (0U)
#define MDF_SADANLVR_ANLVL_Msk              (0x7FFFUL << MDF_SADANLVR_ANLVL_Pos)    /*!< 0x00007FFF */
#define MDF_SADANLVR_ANLVL                  MDF_SADANLVR_ANLVL_Msk                  /*!<Ambiant noise level estimation*/

/*******************  Bit definition for MDF/ADF_SNPSDR register  ********************/
#define MDF_SNPSDR_MCICDC_Pos               (0U)
#define MDF_SNPSDR_MCICDC_Msk               (0x1FFUL << MDF_SNPSDR_MCICDC_Pos)      /*!< 0x000001FF */
#define MDF_SNPSDR_MCICDC                   MDF_SNPSDR_MCICDC_Msk                   /*!<MCIC decimation counter*/
#define MDF_SNPSDR_EXTSDR_Pos               (9U)
#define MDF_SNPSDR_EXTSDR_Msk               (0x7FUL << MDF_SNPSDR_EXTSDR_Pos)       /*!< 0x0000FE00 */
#define MDF_SNPSDR_EXTSDR                   MDF_SNPSDR_EXTSDR_Msk                   /*!<Extended data size*/
#define MDF_SNPSDR_SDR_Pos                  (16U)
#define MDF_SNPSDR_SDR_Msk                  (0xFFFFUL << MDF_SNPSDR_SDR_Pos)        /*!< 0xFFFF0000 */
#define MDF_SNPSDR_SDR                      MDF_SNPSDR_SDR_Msk                      /*!<Extended data size*/

/*******************  Bit definition for MDF/ADF_DFLTDR register  ********************/
#define MDF_DFLTDR_DR_Pos                   (8U)
#define MDF_DFLTDR_DR_Msk                   (0xFFFFFFUL << MDF_DFLTDR_DR_Pos)       /*!< 0xFFFFFF00 */
#define MDF_DFLTDR_DR                       MDF_DFLTDR_DR_Msk                       /*!<MCIC decimation counter*/



/******************************************************************************/
/*                                                                            */
/*                                    (PWR)                                   */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for PWR_CR1 register  ********************/
#define PWR_CR1_VDDIO3VMEN_Pos                 (0U)
#define PWR_CR1_VDDIO3VMEN_Msk                 (0x1UL << PWR_CR1_VDDIO3VMEN_Pos)
#define PWR_CR1_VDDIO3VMEN                     PWR_CR1_VDDIO3VMEN_Msk
#define PWR_CR1_VDDIO4VMEN_Pos                 (1U)
#define PWR_CR1_VDDIO4VMEN_Msk                 (0x1UL << PWR_CR1_VDDIO4VMEN_Pos)
#define PWR_CR1_VDDIO4VMEN                     PWR_CR1_VDDIO4VMEN_Msk
#define PWR_CR1_USB33VMEN_Pos                  (2U)
#define PWR_CR1_USB33VMEN_Msk                  (0x1UL << PWR_CR1_USB33VMEN_Pos)
#define PWR_CR1_USB33VMEN                      PWR_CR1_USB33VMEN_Msk
#define PWR_CR1_UCPDVMEN_Pos                   (3U)
#define PWR_CR1_UCPDVMEN_Msk                   (0x1UL << PWR_CR1_UCPDVMEN_Pos)
#define PWR_CR1_UCPDVMEN                       PWR_CR1_UCPDVMEN_Msk
#define PWR_CR1_AVMEN_Pos                      (4U)
#define PWR_CR1_AVMEN_Msk                      (0x1UL << PWR_CR1_AVMEN_Pos)
#define PWR_CR1_AVMEN                          PWR_CR1_AVMEN_Msk
#define PWR_CR1_VDDIO3SV_Pos                   (8U)
#define PWR_CR1_VDDIO3SV_Msk                   (0x1UL << PWR_CR1_VDDIO3SV_Pos)
#define PWR_CR1_VDDIO3SV                       PWR_CR1_VDDIO3SV_Msk
#define PWR_CR1_VDDIO4SV_Pos                   (9U)
#define PWR_CR1_VDDIO4SV_Msk                   (0x1UL << PWR_CR1_VDDIO4SV_Pos)
#define PWR_CR1_VDDIO4SV                       PWR_CR1_VDDIO4SV_Msk
#define PWR_CR1_UCPDSV_Pos                     (11U)
#define PWR_CR1_UCPDSV_Msk                     (0x1UL << PWR_CR1_UCPDSV_Pos)
#define PWR_CR1_UCPDSV                         PWR_CR1_UCPDSV_Msk
#define PWR_CR1_ASV_Pos                        (12U)
#define PWR_CR1_ASV_Msk                        (0x1UL << PWR_CR1_ASV_Pos)
#define PWR_CR1_ASV                            PWR_CR1_ASV_Msk
#define PWR_CR1_VDDIO3RDY_Pos                  (16U)
#define PWR_CR1_VDDIO3RDY_Msk                  (0x1UL << PWR_CR1_VDDIO3RDY_Pos)
#define PWR_CR1_VDDIO3RDY                      PWR_CR1_VDDIO3RDY_Msk
#define PWR_CR1_VDDIO4RDY_Pos                  (17U)
#define PWR_CR1_VDDIO4RDY_Msk                  (0x1UL << PWR_CR1_VDDIO4RDY_Pos)
#define PWR_CR1_VDDIO4RDY                      PWR_CR1_VDDIO4RDY_Msk
#define PWR_CR1_USB33RDY_Pos                   (18U)
#define PWR_CR1_USB33RDY_Msk                   (0x1UL << PWR_CR1_USB33RDY_Pos)
#define PWR_CR1_USB33RDY                       PWR_CR1_USB33RDY_Msk
#define PWR_CR1_UCPDRDY_Pos                    (19U)
#define PWR_CR1_UCPDRDY_Msk                    (0x1UL << PWR_CR1_UCPDRDY_Pos)
#define PWR_CR1_UCPDRDY                         PWR_CR1_UCPDRDY_Msk
#define PWR_CR1_ARDY_Pos                       (20U)
#define PWR_CR1_ARDY_Msk                       (0x1UL << PWR_CR1_ARDY_Pos)
#define PWR_CR1_ARDY                           PWR_CR1_ARDY_Msk
#define PWR_CR1_VDDIOVRSEL_Pos                 (24U)
#define PWR_CR1_VDDIOVRSEL_Msk                 (0x1UL << PWR_CR1_VDDIOVRSEL_Pos)
#define PWR_CR1_VDDIOVRSEL                     PWR_CR1_VDDIOVRSEL_Msk
#define PWR_CR1_VDDIO3VRSEL_Pos                (25U)
#define PWR_CR1_VDDIO3VRSEL_Msk                (0x1UL << PWR_CR1_VDDIO3VRSEL_Pos)
#define PWR_CR1_VDDIO3VRSEL                    PWR_CR1_VDDIO3VRSEL_Msk
#define PWR_CR1_VDDIO4VRSEL_Pos                (26U)
#define PWR_CR1_VDDIO4VRSEL_Msk                (0x1UL << PWR_CR1_VDDIO4VRSEL_Pos)
#define PWR_CR1_VDDIO4VRSEL                    PWR_CR1_VDDIO4VRSEL_Msk
#define PWR_CR1_GPVMO_Pos                      (31U)
#define PWR_CR1_GPVMO_Msk                      (0x1UL << PWR_CR1_GPVMO_Pos)
#define PWR_CR1_GPVMO                          PWR_CR1_GPVMO_Msk

/* Bit fields for PWR_CR2 register */
#define PWR_CR2_MONEN_Pos                      (0U)
#define PWR_CR2_MONEN_Msk                      (0x1UL << PWR_CR2_MONEN_Pos)
#define PWR_CR2_MONEN                          PWR_CR2_MONEN_Msk  /*!< VBAT and temperature monitoring enableWhen set, the VBAT supply and temperature monitoring is enabled.- 0: VBAT and temperature monitoring disabled.- 1: VBAT and temperature monitoring enabled. */
#define PWR_CR2_VBATL_Pos                      (8U)
#define PWR_CR2_VBATL_Msk                      (0x1UL << PWR_CR2_VBATL_Pos)
#define PWR_CR2_VBATL                          PWR_CR2_VBATL_Msk  /*!< Monitored VBAT level above low threshold- 0: VBAT level above low threshold level, or Monitor disabled.- 1: VBAT level equal or below low threshold level. */
#define PWR_CR2_VBATH_Pos                      (9U)
#define PWR_CR2_VBATH_Msk                      (0x1UL << PWR_CR2_VBATH_Pos)
#define PWR_CR2_VBATH                          PWR_CR2_VBATH_Msk  /*!< Monitored VBAT level above high threshold- 0: VBAT level below high threshold level, or Monitor disabled.- 1: VBAT level equal or above high threshold level. */
#define PWR_CR2_TEMPL_Pos                      (10U)
#define PWR_CR2_TEMPL_Msk                      (0x1UL << PWR_CR2_TEMPL_Pos)
#define PWR_CR2_TEMPL                          PWR_CR2_TEMPL_Msk  /*!< Monitored temperature level above low threshold- 0: Temperature above low threshold level, or Monitor disabled.- 1: Temperature equal or below low threshold level. */
#define PWR_CR2_TEMPH_Pos                      (11U)
#define PWR_CR2_TEMPH_Msk                      (0x1UL << PWR_CR2_TEMPH_Pos)
#define PWR_CR2_TEMPH                          PWR_CR2_TEMPH_Msk  /*!< Monitored temperature level above high threshold- 0: Temperature below high threshold level, or Monitor disabled.- 1: Temperature equal or above high threshold level. */

/* Bit fields for PWR_CR3 register */
#define PWR_CR3_PVDEN_Pos                      (0U)
#define PWR_CR3_PVDEN_Msk                      (0x1UL << PWR_CR3_PVDEN_Pos)
#define PWR_CR3_PVDEN                          PWR_CR3_PVDEN_Msk  /*!< Programmable Voltage detector enable.This bit is read only when the SYSCFG register bit PVDL is set. (When PVDL is set, there will be no bus errors generated when writing this register).- 0: Programmable Voltage detector disabled.- 1: Programmable Voltage detector enabled. */
#define PWR_CR3_PVDO_Pos                       (8U)
#define PWR_CR3_PVDO_Msk                       (0x1UL << PWR_CR3_PVDO_Pos)
#define PWR_CR3_PVDO                           PWR_CR3_PVDO_Msk  /*!< Programmable Voltage Detect OutputThis bit is set and cleared by hardware. It is valid only if PVD is enabled by the PVDEN bit.- 0: VDD or voltage level on PVD_IN is equal or higher than the PVD threshold selected with the PLS[2:0] bits.- 1: VDD or voltage level on PVD_IN is lower than the PVD threshold selected with the PLS[2:0] bits.The PVD is disabled in Standby mode and after a system reset. For this reason, this bit is equal to 0 after Standby and system reset. */


/* Bit fields for PWR_CR5 register */
#define PWR_CR5_VCOREMONEN_Pos                 (0U)
#define PWR_CR5_VCOREMONEN_Msk                 (0x1UL << PWR_CR5_VCOREMONEN_Pos)
#define PWR_CR5_VCOREMONEN                     PWR_CR5_VCOREMONEN_Msk  /*!< VDDCORE monitoring enable.When set, the VDDCORE supply monitoring is enabled.- 0: VDDCORE monitoring disabled.- 1: VDDCORE monitoring enabled. */
#define PWR_CR5_VCOREL_Pos                     (8U)
#define PWR_CR5_VCOREL_Msk                     (0x1UL << PWR_CR5_VCOREL_Pos)
#define PWR_CR5_VCOREL                         PWR_CR5_VCOREL_Msk  /*!< Monitored VDDCORE level above low threshold.- 0: VDDCORE level above low threshold level, or Monitor disabled.- 1: VDDCORE level equal or below low threshold level. */
#define PWR_CR5_VCOREH_Pos                     (9U)
#define PWR_CR5_VCOREH_Msk                     (0x1UL << PWR_CR5_VCOREH_Pos)
#define PWR_CR5_VCOREH                         PWR_CR5_VCOREH_Msk  /*!< Monitored VDDCORE level above high threshold.- 0: VDDCORE level below high threshold level, or Monitor disabled.- 1: VDDCORE level equal or above high threshold level. */

