zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp251dxx_cm0.h
/* Bit fields for PWR_WKUPCR2 register */
#define PWR_WKUPCR2_WKUPC_Pos                  (0U)
#define PWR_WKUPCR2_WKUPC_Msk                  (0x1UL << PWR_WKUPCR2_WKUPC_Pos)
#define PWR_WKUPCR2_WKUPC                      PWR_WKUPCR2_WKUPC_Msk  /*!< Clear Wakeup Flag for WKUPx pin.These bits are always read as 0.- 0: No effect- 1: Writing 1 will clear the WKUPFx Wakeup Flag. (Bit is cleared to 0 by HW) */
#define PWR_WKUPCR2_WKUPP_Pos                  (8U)
#define PWR_WKUPCR2_WKUPP_Msk                  (0x1UL << PWR_WKUPCR2_WKUPP_Pos)
#define PWR_WKUPCR2_WKUPP                      PWR_WKUPCR2_WKUPP_Msk  /*!< Wakeup Polarity bit for WKUPx pinThese bits define the polarity used for event detection on external wake-up WKUPx pin- 0: Detection on high level (rising edge)- 1: Detection on low level (falling edge) */
#define PWR_WKUPCR2_WKUPPUPD_Pos               (12U)
#define PWR_WKUPCR2_WKUPPUPD_Msk               (0x3UL << PWR_WKUPCR2_WKUPPUPD_Pos)
#define PWR_WKUPCR2_WKUPPUPD                   PWR_WKUPCR2_WKUPPUPD_Msk  /*!< Wakeup pull configuration for WKUPx pin.These bits define the IO pad pull configuration used when WKUPENCPU1 or/and WKUPENCPU2 = 1. (note that the associated GPIO port pull configuration shall be set to the same value or 00). The Wakeup Pin pull configuration will be maintained in Standby mode.- 00: No pulls- 01: Pull-up- 10: Pull-down- 11: Reserved */
#define PWR_WKUPCR2_WKUPENCPU1_Pos             (16U)
#define PWR_WKUPCR2_WKUPENCPU1_Msk             (0x1UL << PWR_WKUPCR2_WKUPENCPU1_Pos)
#define PWR_WKUPCR2_WKUPENCPU1                 PWR_WKUPCR2_WKUPENCPU1_Msk  /*!< Enable Wakeup WKUPx pin and interrupt for CPU1.- 0: An event on WKUPx pin does not wakeup the system from Standby and Stop modes, nor generate an interrupt to CPU1.- 1: A rising or falling edge on WKUPx pin wakes-up the system from Standby and Stop modes and generate an interrupt to CPU1. */
#define PWR_WKUPCR2_WKUPENCPU2_Pos             (17U)
#define PWR_WKUPCR2_WKUPENCPU2_Msk             (0x1UL << PWR_WKUPCR2_WKUPENCPU2_Pos)
#define PWR_WKUPCR2_WKUPENCPU2                 PWR_WKUPCR2_WKUPENCPU2_Msk  /*!< Enable Wakeup WKUPx pin and interrupt for CPU2.- 0: An event on WKUPx pin does not wakeup the system from Standby and Stop modes, nor generate an interrupt to CPU2.- 1: A rising or falling edge on WKUPx pin wakes-up the system from Standby and Stop modes and generate an interrupt to CPU2. */
#define PWR_WKUPCR2_WKUPF_Pos                  (31U)
#define PWR_WKUPCR2_WKUPF_Msk                  (0x1UL << PWR_WKUPCR2_WKUPF_Pos)
#define PWR_WKUPCR2_WKUPF                      PWR_WKUPCR2_WKUPF_Msk  /*!< Wakeup flag for WKUPx pin before enable.This bit is set by hardware and cleared only by a NRST Reset or by setting the WKUPCx bit.- 0: No wakeup event occurred- 1: A wakeup event was received from WKUPx pin */

/* Bit fields for PWR_WKUPCR3 register */
#define PWR_WKUPCR3_WKUPC_Pos                  (0U)
#define PWR_WKUPCR3_WKUPC_Msk                  (0x1UL << PWR_WKUPCR3_WKUPC_Pos)
#define PWR_WKUPCR3_WKUPC                      PWR_WKUPCR3_WKUPC_Msk  /*!< Clear Wakeup Flag for WKUPx pin.These bits are always read as 0.- 0: No effect- 1: Writing 1 will clear the WKUPFx Wakeup Flag. (Bit is cleared to 0 by HW) */
#define PWR_WKUPCR3_WKUPP_Pos                  (8U)
#define PWR_WKUPCR3_WKUPP_Msk                  (0x1UL << PWR_WKUPCR3_WKUPP_Pos)
#define PWR_WKUPCR3_WKUPP                      PWR_WKUPCR3_WKUPP_Msk  /*!< Wakeup Polarity bit for WKUPx pinThese bits define the polarity used for event detection on external wake-up WKUPx pin- 0: Detection on high level (rising edge)- 1: Detection on low level (falling edge) */
#define PWR_WKUPCR3_WKUPPUPD_Pos               (12U)
#define PWR_WKUPCR3_WKUPPUPD_Msk               (0x3UL << PWR_WKUPCR3_WKUPPUPD_Pos)
#define PWR_WKUPCR3_WKUPPUPD                   PWR_WKUPCR3_WKUPPUPD_Msk  /*!< Wakeup pull configuration for WKUPx pin.These bits define the IO pad pull configuration used when WKUPENCPU1 or/and WKUPENCPU2 = 1. (note that the associated GPIO port pull configuration shall be set to the same value or 00). The Wakeup Pin pull configuration will be maintained in Standby mode.- 00: No pulls- 01: Pull-up- 10: Pull-down- 11: Reserved */
#define PWR_WKUPCR3_WKUPENCPU1_Pos             (16U)
#define PWR_WKUPCR3_WKUPENCPU1_Msk             (0x1UL << PWR_WKUPCR3_WKUPENCPU1_Pos)
#define PWR_WKUPCR3_WKUPENCPU1                 PWR_WKUPCR3_WKUPENCPU1_Msk  /*!< Enable Wakeup WKUPx pin and interrupt for CPU1.- 0: An event on WKUPx pin does not wakeup the system from Standby and Stop modes, nor generate an interrupt to CPU1.- 1: A rising or falling edge on WKUPx pin wakes-up the system from Standby and Stop modes and generate an interrupt to CPU1. */
#define PWR_WKUPCR3_WKUPENCPU2_Pos             (17U)
#define PWR_WKUPCR3_WKUPENCPU2_Msk             (0x1UL << PWR_WKUPCR3_WKUPENCPU2_Pos)
#define PWR_WKUPCR3_WKUPENCPU2                 PWR_WKUPCR3_WKUPENCPU2_Msk  /*!< Enable Wakeup WKUPx pin and interrupt for CPU2.- 0: An event on WKUPx pin does not wakeup the system from Standby and Stop modes, nor generate an interrupt to CPU2.- 1: A rising or falling edge on WKUPx pin wakes-up the system from Standby and Stop modes and generate an interrupt to CPU2. */
#define PWR_WKUPCR3_WKUPF_Pos                  (31U)
#define PWR_WKUPCR3_WKUPF_Msk                  (0x1UL << PWR_WKUPCR3_WKUPF_Pos)
#define PWR_WKUPCR3_WKUPF                      PWR_WKUPCR3_WKUPF_Msk  /*!< Wakeup flag for WKUPx pin before enable.This bit is set by hardware and cleared only by a NRST Reset or by setting the WKUPCx bit.- 0: No wakeup event occurred- 1: A wakeup event was received from WKUPx pin */

/* Bit fields for PWR_WKUPCR4 register */
#define PWR_WKUPCR4_WKUPC_Pos                  (0U)
#define PWR_WKUPCR4_WKUPC_Msk                  (0x1UL << PWR_WKUPCR4_WKUPC_Pos)
#define PWR_WKUPCR4_WKUPC                      PWR_WKUPCR4_WKUPC_Msk  /*!< Clear Wakeup Flag for WKUPx pin.These bits are always read as 0.- 0: No effect- 1: Writing 1 will clear the WKUPFx Wakeup Flag. (Bit is cleared to 0 by HW) */
#define PWR_WKUPCR4_WKUPP_Pos                  (8U)
#define PWR_WKUPCR4_WKUPP_Msk                  (0x1UL << PWR_WKUPCR4_WKUPP_Pos)
#define PWR_WKUPCR4_WKUPP                      PWR_WKUPCR4_WKUPP_Msk  /*!< Wakeup Polarity bit for WKUPx pinThese bits define the polarity used for event detection on external wake-up WKUPx pin- 0: Detection on high level (rising edge)- 1: Detection on low level (falling edge) */
#define PWR_WKUPCR4_WKUPPUPD_Pos               (12U)
#define PWR_WKUPCR4_WKUPPUPD_Msk               (0x3UL << PWR_WKUPCR4_WKUPPUPD_Pos)
#define PWR_WKUPCR4_WKUPPUPD                   PWR_WKUPCR4_WKUPPUPD_Msk  /*!< Wakeup pull configuration for WKUPx pin.These bits define the IO pad pull configuration used when WKUPENCPU1 or/and WKUPENCPU2 = 1. (note that the associated GPIO port pull configuration shall be set to the same value or 00). The Wakeup Pin pull configuration will be maintained in Standby mode.- 00: No pulls- 01: Pull-up- 10: Pull-down- 11: Reserved */
#define PWR_WKUPCR4_WKUPENCPU1_Pos             (16U)
#define PWR_WKUPCR4_WKUPENCPU1_Msk             (0x1UL << PWR_WKUPCR4_WKUPENCPU1_Pos)
#define PWR_WKUPCR4_WKUPENCPU1                 PWR_WKUPCR4_WKUPENCPU1_Msk  /*!< Enable Wakeup WKUPx pin and interrupt for CPU1.- 0: An event on WKUPx pin does not wakeup the system from Standby and Stop modes, nor generate an interrupt to CPU1.- 1: A rising or falling edge on WKUPx pin wakes-up the system from Standby and Stop modes and generate an interrupt to CPU1. */
#define PWR_WKUPCR4_WKUPENCPU2_Pos             (17U)
#define PWR_WKUPCR4_WKUPENCPU2_Msk             (0x1UL << PWR_WKUPCR4_WKUPENCPU2_Pos)
#define PWR_WKUPCR4_WKUPENCPU2                 PWR_WKUPCR4_WKUPENCPU2_Msk  /*!< Enable Wakeup WKUPx pin and interrupt for CPU2.- 0: An event on WKUPx pin does not wakeup the system from Standby and Stop modes, nor generate an interrupt to CPU2.- 1: A rising or falling edge on WKUPx pin wakes-up the system from Standby and Stop modes and generate an interrupt to CPU2. */
#define PWR_WKUPCR4_WKUPF_Pos                  (31U)
#define PWR_WKUPCR4_WKUPF_Msk                  (0x1UL << PWR_WKUPCR4_WKUPF_Pos)
#define PWR_WKUPCR4_WKUPF                      PWR_WKUPCR4_WKUPF_Msk  /*!< Wakeup flag for WKUPx pin before enable.This bit is set by hardware and cleared only by a NRST Reset or by setting the WKUPCx bit.- 0: No wakeup event occurred- 1: A wakeup event was received from WKUPx pin */

