zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp251dxx_cm0.h
/* Bit fields for PWR_WKUPCR5 register */
#define PWR_WKUPCR5_WKUPC_Pos                  (0U)
#define PWR_WKUPCR5_WKUPC_Msk                  (0x1UL << PWR_WKUPCR5_WKUPC_Pos)
#define PWR_WKUPCR5_WKUPC                      PWR_WKUPCR5_WKUPC_Msk  /*!< Clear Wakeup Flag for WKUPx pin.These bits are always read as 0.- 0: No effect- 1: Writing 1 will clear the WKUPFx Wakeup Flag. (Bit is cleared to 0 by HW) */
#define PWR_WKUPCR5_WKUPP_Pos                  (8U)
#define PWR_WKUPCR5_WKUPP_Msk                  (0x1UL << PWR_WKUPCR5_WKUPP_Pos)
#define PWR_WKUPCR5_WKUPP                      PWR_WKUPCR5_WKUPP_Msk  /*!< Wakeup Polarity bit for WKUPx pinThese bits define the polarity used for event detection on external wake-up WKUPx pin- 0: Detection on high level (rising edge)- 1: Detection on low level (falling edge) */
#define PWR_WKUPCR5_WKUPPUPD_Pos               (12U)
#define PWR_WKUPCR5_WKUPPUPD_Msk               (0x3UL << PWR_WKUPCR5_WKUPPUPD_Pos)
#define PWR_WKUPCR5_WKUPPUPD                   PWR_WKUPCR5_WKUPPUPD_Msk  /*!< Wakeup pull configuration for WKUPx pin.These bits define the IO pad pull configuration used when WKUPENCPU1 or/and WKUPENCPU2 = 1. (note that the associated GPIO port pull configuration shall be set to the same value or 00). The Wakeup Pin pull configuration will be maintained in Standby mode.- 00: No pulls- 01: Pull-up- 10: Pull-down- 11: Reserved */
#define PWR_WKUPCR5_WKUPENCPU1_Pos             (16U)
#define PWR_WKUPCR5_WKUPENCPU1_Msk             (0x1UL << PWR_WKUPCR5_WKUPENCPU1_Pos)
#define PWR_WKUPCR5_WKUPENCPU1                 PWR_WKUPCR5_WKUPENCPU1_Msk  /*!< Enable Wakeup WKUPx pin and interrupt for CPU1.- 0: An event on WKUPx pin does not wakeup the system from Standby and Stop modes, nor generate an interrupt to CPU1.- 1: A rising or falling edge on WKUPx pin wakes-up the system from Standby and Stop modes and generate an interrupt to CPU1. */
#define PWR_WKUPCR5_WKUPENCPU2_Pos             (17U)
#define PWR_WKUPCR5_WKUPENCPU2_Msk             (0x1UL << PWR_WKUPCR5_WKUPENCPU2_Pos)
#define PWR_WKUPCR5_WKUPENCPU2                 PWR_WKUPCR5_WKUPENCPU2_Msk  /*!< Enable Wakeup WKUPx pin and interrupt for CPU2.- 0: An event on WKUPx pin does not wakeup the system from Standby and Stop modes, nor generate an interrupt to CPU2.- 1: A rising or falling edge on WKUPx pin wakes-up the system from Standby and Stop modes and generate an interrupt to CPU2. */
#define PWR_WKUPCR5_WKUPF_Pos                  (31U)
#define PWR_WKUPCR5_WKUPF_Msk                  (0x1UL << PWR_WKUPCR5_WKUPF_Pos)
#define PWR_WKUPCR5_WKUPF                      PWR_WKUPCR5_WKUPF_Msk  /*!< Wakeup flag for WKUPx pin before enable.This bit is set by hardware and cleared only by a NRST Reset or by setting the WKUPCx bit.- 0: No wakeup event occurred- 1: A wakeup event was received from WKUPx pin */

/* Bit fields for PWR_WKUPCR6 register */
#define PWR_WKUPCR6_WKUPC_Pos                  (0U)
#define PWR_WKUPCR6_WKUPC_Msk                  (0x1UL << PWR_WKUPCR6_WKUPC_Pos)
#define PWR_WKUPCR6_WKUPC                      PWR_WKUPCR6_WKUPC_Msk  /*!< Clear Wakeup Flag for WKUPx pin.These bits are always read as 0.- 0: No effect- 1: Writing 1 will clear the WKUPFx Wakeup Flag. (Bit is cleared to 0 by HW) */
#define PWR_WKUPCR6_WKUPP_Pos                  (8U)
#define PWR_WKUPCR6_WKUPP_Msk                  (0x1UL << PWR_WKUPCR6_WKUPP_Pos)
#define PWR_WKUPCR6_WKUPP                      PWR_WKUPCR6_WKUPP_Msk  /*!< Wakeup Polarity bit for WKUPx pinThese bits define the polarity used for event detection on external wake-up WKUPx pin- 0: Detection on high level (rising edge)- 1: Detection on low level (falling edge) */
#define PWR_WKUPCR6_WKUPPUPD_Pos               (12U)
#define PWR_WKUPCR6_WKUPPUPD_Msk               (0x3UL << PWR_WKUPCR6_WKUPPUPD_Pos)
#define PWR_WKUPCR6_WKUPPUPD                   PWR_WKUPCR6_WKUPPUPD_Msk  /*!< Wakeup pull configuration for WKUPx pin.These bits define the IO pad pull configuration used when WKUPENCPU1 or/and WKUPENCPU2 = 1. (note that the associated GPIO port pull configuration shall be set to the same value or 00). The Wakeup Pin pull configuration will be maintained in Standby mode.- 00: No pulls- 01: Pull-up- 10: Pull-down- 11: Reserved */
#define PWR_WKUPCR6_WKUPENCPU1_Pos             (16U)
#define PWR_WKUPCR6_WKUPENCPU1_Msk             (0x1UL << PWR_WKUPCR6_WKUPENCPU1_Pos)
#define PWR_WKUPCR6_WKUPENCPU1                 PWR_WKUPCR6_WKUPENCPU1_Msk  /*!< Enable Wakeup WKUPx pin and interrupt for CPU1.- 0: An event on WKUPx pin does not wakeup the system from Standby and Stop modes, nor generate an interrupt to CPU1.- 1: A rising or falling edge on WKUPx pin wakes-up the system from Standby and Stop modes and generate an interrupt to CPU1. */
#define PWR_WKUPCR6_WKUPENCPU2_Pos             (17U)
#define PWR_WKUPCR6_WKUPENCPU2_Msk             (0x1UL << PWR_WKUPCR6_WKUPENCPU2_Pos)
#define PWR_WKUPCR6_WKUPENCPU2                 PWR_WKUPCR6_WKUPENCPU2_Msk  /*!< Enable Wakeup WKUPx pin and interrupt for CPU2.- 0: An event on WKUPx pin does not wakeup the system from Standby and Stop modes, nor generate an interrupt to CPU2.- 1: A rising or falling edge on WKUPx pin wakes-up the system from Standby and Stop modes and generate an interrupt to CPU2. */
#define PWR_WKUPCR6_WKUPF_Pos                  (31U)
#define PWR_WKUPCR6_WKUPF_Msk                  (0x1UL << PWR_WKUPCR6_WKUPF_Pos)
#define PWR_WKUPCR6_WKUPF                      PWR_WKUPCR6_WKUPF_Msk  /*!< Wakeup flag for WKUPx pin before enable.This bit is set by hardware and cleared only by a NRST Reset or by setting the WKUPCx bit.- 0: No wakeup event occurred- 1: A wakeup event was received from WKUPx pin */

/* Bit fields for PWR_D3WKUPENR register */
#define PWR_D3WKUPENR_TAMP_WKUPEN_D3_Pos       (0U)
#define PWR_D3WKUPENR_TAMP_WKUPEN_D3_Msk       (0x1UL << PWR_D3WKUPENR_TAMP_WKUPEN_D3_Pos)
#define PWR_D3WKUPENR_TAMP_WKUPEN_D3           PWR_D3WKUPENR_TAMP_WKUPEN_D3_Msk  /*!< Enable Wakeup pin for D3 domain in VBAT mode.The bit is set and cleared by software.- 0: A tamper event on D3WKUP pin does not wakeup the D3 domain from SStandby in VBAT mode.- 1: A rising or falling edge on D3WKUP pin wakes-up the D3 domain from SStandby in VBAT mode. */

/* Bit fields for PWR_RSECCFGR register */
#define PWR_RSECCFGR_RSEC0_Pos                 (0U)
#define PWR_RSECCFGR_RSEC0_Msk                 (0x1UL << PWR_RSECCFGR_RSEC0_Pos)
#define PWR_RSECCFGR_RSEC0                     PWR_RSECCFGR_RSEC0_Msk  /*!< Secure attribute reference for the local resource number x (x = 0)These bits are written by software to enabled the secure mode for the local resource x.- 0: The local resource number x is non-secure. Secure access is also possible.- 1: The local resource number x is secure only.This bit can only be written by secure application. If corresponding PRIVx bit is set in PWR_RPRIVCFGR this bit can only be written by secure privileged application.If compartment filtering for this local resource is enabled by setting CFEN bit in PWR_RxCIDCFGR, only an allowed compartment can write this bit, on top of secure and privileged restriction. */
#define PWR_RSECCFGR_RSEC1_Pos                 (1U)
#define PWR_RSECCFGR_RSEC1_Msk                 (0x1UL << PWR_RSECCFGR_RSEC1_Pos)
#define PWR_RSECCFGR_RSEC1                     PWR_RSECCFGR_RSEC1_Msk  /*!< Secure attribute reference for the local resource number x (x = 1)See RSEC0 for details. */
#define PWR_RSECCFGR_RSEC2_Pos                 (2U)
#define PWR_RSECCFGR_RSEC2_Msk                 (0x1UL << PWR_RSECCFGR_RSEC2_Pos)
#define PWR_RSECCFGR_RSEC2                     PWR_RSECCFGR_RSEC2_Msk  /*!< Secure attribute reference for the local resource number x (x = 2)See RSEC0 for details. */
#define PWR_RSECCFGR_RSEC3_Pos                 (3U)
#define PWR_RSECCFGR_RSEC3_Msk                 (0x1UL << PWR_RSECCFGR_RSEC3_Pos)
#define PWR_RSECCFGR_RSEC3                     PWR_RSECCFGR_RSEC3_Msk  /*!< Secure attribute reference for the local resource number x (x = 3)See RSEC0 for details. */
#define PWR_RSECCFGR_RSEC4_Pos                 (4U)
#define PWR_RSECCFGR_RSEC4_Msk                 (0x1UL << PWR_RSECCFGR_RSEC4_Pos)
#define PWR_RSECCFGR_RSEC4                     PWR_RSECCFGR_RSEC4_Msk  /*!< Secure attribute reference for the local resource number x (x = 4)See RSEC0 for details. */
#define PWR_RSECCFGR_RSEC5_Pos                 (5U)
#define PWR_RSECCFGR_RSEC5_Msk                 (0x1UL << PWR_RSECCFGR_RSEC5_Pos)
#define PWR_RSECCFGR_RSEC5                     PWR_RSECCFGR_RSEC5_Msk  /*!< Secure attribute reference for the local resource number x (x = 5)See RSEC0 for details. */
#define PWR_RSECCFGR_RSEC6_Pos                 (6U)
#define PWR_RSECCFGR_RSEC6_Msk                 (0x1UL << PWR_RSECCFGR_RSEC6_Pos)
#define PWR_RSECCFGR_RSEC6                     PWR_RSECCFGR_RSEC6_Msk  /*!< Secure attribute reference for the local resource number x (x = 6)See RSEC0 for details. */

